package dart.blackcat.talker.ru;

public class Suffix extends AbstractAffix {

	@Override
	public String[] getMorfemes() {
		return new String[] {
				// суффиксы существительных
				"ан", "ян", "анин", "янин", "ач", "ени", "ет", "еств", "ств", "есть", "ец", "изм", "изн", "ик", "ник", "ин", "ист", "итель", "тель", "их", "иц", "ниц", "к", "л", "лк", "льник", "льщик", "льщиц", "ни", "от", "ость", "ун", "чик", "чиц", "щик",
				// суффиксы прилагательных
				"ал", "ел", "ан", "ян", "аст", "ат", "ев", "ов", "еват", "оват", "ен", "енн", "онн", "енск", "инск", "ив", "лив", "чив", "ин", "ист", "ит", "овит", "к", "л", "н", "шн", "ельн", "уч", "юч", "яч", "чат",
				// суффиксы глаголов
				"а", "я", "ка", "е", "ева", "ова", "ыва", "ива", "и", "л", "нича", "ну", "ствова", "ся", "ть", "ти",
				// суффиксы наречий
				"а", "е", "ейш", "айш", "и", "жды", "либо", "нибудь", "о", "то", "учи", "ючи", "ик",
				// суффиксы местоимений 
				"либо", "нибудь", "то", "б", "а", "к", "а", "ни", "е", "ени", "е", "ск", "ий", "ов", "ск", "ий", "ан", "ск", "ий", "иан", "ск", "ий", "ин", "ск", "ий", "ий", "ск", "ий", "тельн", "ый", "тель", "ств", "о",
		};
	}

}
